Revit 2026 API

# ISaveSharedCoordinatesCallback Methods

---

The ISaveSharedCoordinatesCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSaveModifiedLinksOption | Determines whether Revit should save the link, not save the link, or discard shared positioning entirely. |

#### Reference

ISaveSharedCoordinatesCallback Interface

Autodesk.Revit.DB Namespace